app/controllers/assets_controller.rb

  def index
    @assets = Asset.all
---
SELECT id FROM "assets" ORDER BY id DESC

  def show
    @asset = Asset.find(params[:id])
---
SELECT * FROM "assets" WHERE ("assets"."id" = 1)

  def edit
    @asset = Asset.find(params[:id])
---
SELECT * FROM "assets" WHERE ("assets"."id" = 1)

  def create
    @asset = Asset.new(params[:asset])

    respond_to do |format|
      if @asset.save
---
INSERT INTO "assets" ("name", "serial", "location", "created_at", "updated_at", "user_id", "description") VALUES('Monitor', '78999-9999R', 'Room 220', '2011-02-14 13:50:32', '2011-02-14 13:50:32', NULL, '800 x 1000 px flat screne monitor')

  def update
    @asset = Asset.find(params[:id])

    respond_to do |format|
      if @asset.update_attributes(params[:asset])
---
SELECT * FROM "assets" WHERE ("assets"."id" = 4)
UPDATE "assets" SET "updated_at" = '2011-02-07 14:49:07', "serial" = 'fj', "location" = 'room 566', "name" = '67i', "description" = 'jtyjtyh' WHERE "id" = 10

  def destroy
    @asset = Asset.find(params[:id])
    @asset.destroy
---
SELECT * FROM "assets" WHERE ("assets"."id" = 8)
DELETE FROM "assets" WHERE "id" = 8